src/Reports/ОтчетПоВыработкеНаСтендеСводный/ОтчетПоВыработкеНаСтендеСводный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоВыработкеНаСтендеСводный</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/СтендовыйПрогон/СтендовыйПрогон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтендовыйПрогон</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Прогон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсполнительПоступление</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительПостановка</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПостановки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительСнятие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСнятия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Стенд</name>
    <type>
      <types>CatalogRef.Стенды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/РабочиеМестаЛинеек/РабочиеМестаЛинеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеМестаЛинеек</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Авторизовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗаданийПоВремениПоступления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРабочихМест</name>
    <type>
      <types>CatalogRef.ГруппыРабочихМест</types>
    </type>
  </attributes>
  <attributes>
    <name>Стенд</name>
    <type>
      <types>CatalogRef.Стенды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучениеЗаданияСканированием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучениеЗаданияСканированиемВТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаканчиватьПредыдущийЭтап</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводIMEI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводMACАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводКодDanfoss</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводBT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБуфер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнитьТехОснастку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ОтчетПоВыработкеНаСтендеСводный/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПолучитьРМ()
СписокРабочихМестСтенд.Очистить();
	Для каждого Стр Из СписокЛинеек Цикл
	РабочиеМеста = Справочники.РабочиеМестаЛинеек.Выбрать(,,Новый Структура("Линейка",Стр.Значение));
	флНайдено = Ложь;
		Пока РабочиеМеста.Следующий() Цикл
			Если РабочиеМеста.ЭтоГруппа Тогда
			Продолжить;		
			КонецЕсли; 
				Если СокрЛП(РабочиеМеста.ГруппаРабочихМест.Префикс) = "СТ" Тогда
				СписокРабочихМестСтенд.Добавить(РабочиеМеста.Ссылка);
				флНайдено = Истина;		
				КонецЕсли; 
		КонецЦикла;
			Если Не флНайдено Тогда
			Сообщить("Рабочее место <Стенд> не найдено в линейке "+Стр.Значение+"!");
			КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
ПолучитьРМ();

ТаблицаСП = Новый ТаблицаЗначений;

ТаблицаСП.Колонки.Добавить("Линейка",Новый ОписаниеТипов("СправочникСсылка.Линейки"));
ТаблицаСП.Колонки.Добавить("Исполнитель",Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
ТаблицаСП.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТаблицаСП.Колонки.Добавить("КолПринято",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)));
ТаблицаСП.Колонки.Добавить("КолПоставлено",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)));
ТаблицаСП.Колонки.Добавить("КолСнято",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)));
ТаблицаСП.Колонки.Добавить("КолРемонт",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)));
ТаблицаСП.Колонки.Добавить("КолВторичныйПрогон",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)));

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");
 
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблЛинейка = Макет.ПолучитьОбласть("Линейка");
ОблЛинейкаИтого = Макет.ПолучитьОбласть("ЛинейкаИтого");
ОблИсполнитель = Макет.ПолучитьОбласть("Исполнитель");
ОблИсполнительГруппировка = Макет.ПолучитьОбласть("ИсполнительГруппировка");
ОблИсполнительИтого = Макет.ПолучитьОбласть("ИсполнительИтого");
ОблНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтендовыйПрогон.ИсполнительПоступление,
	|	СтендовыйПрогон.ДатаПоступления,
	|	СтендовыйПрогон.Прогон,
	|	СтендовыйПрогон.Изделие,
	|	СтендовыйПрогон.ПЗ.Линейка КАК Линейка
	|ИЗ
	|	РегистрСведений.СтендовыйПрогон КАК СтендовыйПрогон
	|ГДЕ
	|	СтендовыйПрогон.ПЗ.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И СтендовыйПрогон.ДатаПоступления МЕЖДУ &ДатаНач И &ДатаКон";
	Если СписокНоменклатуры.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " СтендовыйПрогон.Изделие В ИЕРАРХИИ(&СписокНоменклатуры)";
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	КонецЕсли; 	
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаСП.Добавить();
	ТЧ.Линейка = Выборка.Линейка;
	ТЧ.Исполнитель = Выборка.ИсполнительПоступление;
	ТЧ.Номенклатура = Выборка.Изделие;
		Если КоличествоВ = 1 Тогда
		ТЧ.КолПринято = 1;				
		Иначе
		ТЧ.КолПринято = Выборка.Изделие.УсловныеПриборы;
		КонецЕсли;
			Если Выборка.Прогон > 1 Тогда
				Если КоличествоВ = 1 Тогда
				ТЧ.КолВторичныйПрогон = 1;				
				Иначе
				ТЧ.КолВторичныйПрогон = Выборка.Изделие.УсловныеПриборы;
				КонецЕсли;				
			КонецЕсли; 
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтендовыйПрогон.Изделие,
	|	СтендовыйПрогон.ПЗ.Линейка КАК Линейка,
	|	СтендовыйПрогон.ИсполнительПостановка,
	|	СтендовыйПрогон.ДатаПостановки
	|ИЗ
	|	РегистрСведений.СтендовыйПрогон КАК СтендовыйПрогон
	|ГДЕ
	|	СтендовыйПрогон.ПЗ.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И СтендовыйПрогон.ДатаПостановки МЕЖДУ &ДатаНач И &ДатаКон";
	Если СписокНоменклатуры.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " СтендовыйПрогон.Изделие В ИЕРАРХИИ(&СписокНоменклатуры)";
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	КонецЕсли;	
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаСП.Добавить();
	ТЧ.Линейка = Выборка.Линейка;
	ТЧ.Исполнитель = Выборка.ИсполнительПостановка;
	ТЧ.Номенклатура = Выборка.Изделие;
		Если КоличествоВ = 1 Тогда
		ТЧ.КолПоставлено = 1;				
		Иначе
		ТЧ.КолПоставлено = Выборка.Изделие.УсловныеПриборы;
		КонецЕсли; 
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтендовыйПрогон.Изделие,
	|	СтендовыйПрогон.ПЗ.Линейка КАК Линейка,
	|	СтендовыйПрогон.ИсполнительСнятие,
	|	СтендовыйПрогон.ДатаСнятия
	|ИЗ
	|	РегистрСведений.СтендовыйПрогон КАК СтендовыйПрогон
	|ГДЕ
	|	СтендовыйПрогон.ПЗ.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И СтендовыйПрогон.ДатаСнятия МЕЖДУ &ДатаНач И &ДатаКон";
	Если СписокНоменклатуры.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " СтендовыйПрогон.Изделие В ИЕРАРХИИ(&СписокНоменклатуры)";
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	КонецЕсли;	
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаСП.Добавить();
	ТЧ.Линейка = Выборка.Линейка;
	ТЧ.Исполнитель = Выборка.ИсполнительСнятие;
	ТЧ.Номенклатура = Выборка.Изделие;
		Если КоличествоВ = 1 Тогда
		ТЧ.КолСнято = 1;				
		Иначе
		ТЧ.КолСнято = Выборка.Изделие.УсловныеПриборы;
		КонецЕсли; 
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	РемонтнаяКарта.Ссылка,
	|	РемонтнаяКарта.ДокументОснование.Изделие КАК Изделие,
	|	РемонтнаяКарта.РабочееМесто.Стенд.Исполнитель КАК Исполнитель
	|ИЗ
	|	Документ.РемонтнаяКарта КАК РемонтнаяКарта
	|ГДЕ
	|	РемонтнаяКарта.РабочееМесто В(&СписокРабочихМестСтенд)
	|	И РемонтнаяКарта.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	Если СписокНоменклатуры.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " РемонтнаяКарта.ДокументОснование.Изделие В ИЕРАРХИИ(&СписокНоменклатуры)";
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	КонецЕсли;	
Запрос.УстановитьПараметр("СписокРабочихМестСтенд",СписокРабочихМестСтенд);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаСП.Добавить();
	ТЧ.Линейка = Выборка.Ссылка.Линейка;
	ТЧ.Исполнитель = Выборка.Исполнитель;
	ТЧ.Номенклатура = Выборка.Изделие;
		Если КоличествоВ = 1 Тогда
		ТЧ.КолРемонт = 1;				
		Иначе
		ТЧ.КолРемонт = Выборка.Изделие.УсловныеПриборы;
		КонецЕсли; 
	КонецЦикла;
		Если РазвернутьПоНоменклатуре Тогда
		ТаблицаСП.Свернуть("Линейка,Исполнитель,Номенклатура","КолПринято,КолПоставлено,КолСнято,КолРемонт,КолВторичныйПрогон");
		ТаблицаСП.Сортировать("Линейка,Исполнитель,Номенклатура");
		Иначе
		ТаблицаСП.Свернуть("Линейка,Исполнитель","КолПринято,КолПоставлено,КолСнято,КолРемонт,КолВторичныйПрогон"); 
		ТаблицаСП.Сортировать("Линейка,Исполнитель");
		КонецЕсли;
ТекЛинейка = Справочники.Линейки.ПустаяСсылка();
ТекИсполнитель = Справочники.Сотрудники.ПустаяСсылка();
КолПринятоЛинейка = 0;
КолПоставленоЛинейка = 0;
КолСнятоЛинейка = 0;
КолРемонтЛинейка = 0;	
КолВторичныйПрогонЛинейка = 0;
КолПринятоИсполнитель = 0;
КолПоставленоИсполнитель = 0;
КолСнятоИсполнитель = 0;
КолРемонтИсполнитель = 0;	
КолВторичныйПрогонИсполнитель = 0;
	Для каждого ТЧ Из ТаблицаСП Цикл
	КолПринято = ТЧ.КолПринято;
	КолПоставлено = ТЧ.КолПоставлено;
	КолСнято = ТЧ.КолСнято;
	КолРемонт = ТЧ.КолРемонт;	
	КолВторичныйПрогон = ТЧ.КолВторичныйПрогон;
		Если ТекЛинейка <> ТЧ.Линейка Тогда
			Если Не ТекЛинейка.Пустая()  Тогда
			ОблЛинейкаИтого.Параметры.КолПринятоЛинейка = КолПринятоЛинейка;
			ОблЛинейкаИтого.Параметры.КолПоставленоЛинейка = КолПоставленоЛинейка;
			ОблЛинейкаИтого.Параметры.КолСнятоЛинейка = КолСнятоЛинейка;
			ОблЛинейкаИтого.Параметры.КолРемонтЛинейка = КолРемонтЛинейка;
			ОблЛинейкаИтого.Параметры.КолВторичныйПрогонЛинейка = КолВторичныйПрогонЛинейка;
			ТабДок.Вывести(ОблЛинейкаИтого);
			КонецЕсли;
		ОблЛинейка.Параметры.Линейка = ""+ТЧ.Линейка + " ("+ТЧ.Линейка.Комментарий+")";
		ТабДок.Вывести(ОблЛинейка);
		КолПринятоЛинейка = 0;
		КолПоставленоЛинейка = 0;
		КолСнятоЛинейка = 0;
		КолРемонтЛинейка = 0;	
		КолВторичныйПрогонЛинейка = 0;
		ТекЛинейка = ТЧ.Линейка;
		КонецЕсли;
			Если РазвернутьПоНоменклатуре Тогда
				Если ТекИсполнитель <> ТЧ.Исполнитель Тогда
					Если Не ТекИсполнитель.Пустая()  Тогда
					ОблИсполнительИтого.Параметры.КолПринятоИсполнитель = КолПринятоИсполнитель;
					ОблИсполнительИтого.Параметры.КолПоставленоИсполнитель = КолПоставленоИсполнитель;
					ОблИсполнительИтого.Параметры.КолСнятоИсполнитель = КолСнятоИсполнитель;
					ОблИсполнительИтого.Параметры.КолРемонтИсполнитель = КолРемонтИсполнитель;
					ОблИсполнительИтого.Параметры.КолВторичныйПрогонИсполнитель = КолВторичныйПрогонИсполнитель;
					ТабДок.Вывести(ОблИсполнительИтого);
					КонецЕсли;
				ОблИсполнительГруппировка.Параметры.Исполнитель = СокрЛП(ТЧ.Исполнитель.Наименование);
				ТабДок.Вывести(ОблИсполнительГруппировка);
				КолПринятоИсполнитель = 0;
				КолПоставленоИсполнитель = 0;
				КолСнятоИсполнитель = 0;
				КолРемонтИсполнитель = 0;	
				КолВторичныйПрогонИсполнитель = 0;
				ТекИсполнитель = ТЧ.Исполнитель;
				КонецЕсли; 
			КолПринятоИсполнитель = КолПринятоИсполнитель+КолПринято;
			КолПоставленоИсполнитель = КолПоставленоИсполнитель+КолПоставлено;
			КолСнятоИсполнитель = КолСнятоИсполнитель+КолСнято;
			КолРемонтИсполнитель = КолРемонтИсполнитель+КолРемонт;	
			КолВторичныйПрогонИсполнитель = КолВторичныйПрогонИсполнитель+КолВторичныйПрогон;
			ОблНоменклатура.Параметры.Наименование = СокрЛП(ТЧ.Номенклатура.Наименование);
			ОблНоменклатура.Параметры.Номенклатура = ТЧ.Номенклатура;	
			ОблНоменклатура.Параметры.КолПринято = КолПринято;
			ОблНоменклатура.Параметры.КолПоставлено = КолПоставлено;
			ОблНоменклатура.Параметры.КолСнято = КолСнято;
			ОблНоменклатура.Параметры.КолРемонт = КолРемонт;
			ОблНоменклатура.Параметры.КолВторичныйПрогон = КолВторичныйПрогон;
			ТабДок.Вывести(ОблНоменклатура);
			Иначе
			ОблИсполнитель.Параметры.Исполнитель = СокрЛП(ТЧ.Исполнитель.Наименование);
			ОблИсполнитель.Параметры.КолПринято = КолПринято;
			ОблИсполнитель.Параметры.КолПоставлено = КолПоставлено;
			ОблИсполнитель.Параметры.КолСнято = КолСнято;
			ОблИсполнитель.Параметры.КолРемонт = КолРемонт;
			ОблИсполнитель.Параметры.КолВторичныйПрогон = КолВторичныйПрогон;
			ТабДок.Вывести(ОблИсполнитель);			
			КонецЕсли; 
	КолПринятоЛинейка = КолПринятоЛинейка+КолПринято;
	КолПоставленоЛинейка = КолПоставленоЛинейка+КолПоставлено;
	КолСнятоЛинейка = КолСнятоЛинейка+КолСнято;
	КолРемонтЛинейка = КолРемонтЛинейка+КолРемонт;	
	КолВторичныйПрогонЛинейка = КолВторичныйПрогонЛинейка+КолВторичныйПрогон; 
	КонецЦикла;
		Если РазвернутьПоНоменклатуре Тогда
		ОблИсполнительИтого.Параметры.КолПринятоИсполнитель = КолПринятоИсполнитель;
		ОблИсполнительИтого.Параметры.КолПоставленоИсполнитель = КолПоставленоИсполнитель;
		ОблИсполнительИтого.Параметры.КолСнятоИсполнитель = КолСнятоИсполнитель;
		ОблИсполнительИтого.Параметры.КолРемонтИсполнитель = КолРемонтИсполнитель;
		ОблИсполнительИтого.Параметры.КолВторичныйПрогонИсполнитель = КолВторичныйПрогонИсполнитель;
		ТабДок.Вывести(ОблИсполнительИтого);		
		КонецЕсли; 
ОблЛинейкаИтого.Параметры.КолПринятоЛинейка = КолПринятоЛинейка;
ОблЛинейкаИтого.Параметры.КолПоставленоЛинейка = КолПоставленоЛинейка;
ОблЛинейкаИтого.Параметры.КолСнятоЛинейка = КолСнятоЛинейка;
ОблЛинейкаИтого.Параметры.КолРемонтЛинейка = КолРемонтЛинейка;
ОблЛинейкаИтого.Параметры.КолВторичныйПрогонЛинейка = КолВторичныйПрогонЛинейка;
ТабДок.Вывести(ОблЛинейкаИтого); 	
ОблКонец.Параметры.КолПринятоВсего = ТаблицаСП.Итог("КолПринято");
ОблКонец.Параметры.КолПоставленоВсего = ТаблицаСП.Итог("КолПоставлено");
ОблКонец.Параметры.КолСнятоВсего = ТаблицаСП.Итог("КолСнято");
ОблКонец.Параметры.КолРемонтВсего = ТаблицаСП.Итог("КолРемонт");
ОблКонец.Параметры.КолВторичныйПрогонВсего = ТаблицаСП.Итог("КолВторичныйПрогон");
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
